init.org
#+title: Configuration file
#+auto_tangle: t

* How this file works
:PROPERTIES:
:ID:       c4f1d90a-3afd-4884-af24-8134fb163535
:END:

This file is provided with the git repository: any updates (see the readme for update instructions) will reset this file as intended. Therefore, modifying it is pointless. However, to customize it, see [[id:c9bd19aa-b1c5-4d96-b4d9-1fb09aaedae8][How to modify the configuration]].

** Basic Code Block

This is a basic example of a code block in Org mode. Code blocks are enclosed in "#+begin_src" and "#+end_src" tags. The language of the code block (e.g., emacs-lisp) is specified right after "#+begin_src".

#+begin_src emacs-lisp
  ;; Simple function definition in Emacs Lisp
    (message "Hello, world!")
#+end_src

This block does not interact with any external files or parts of the document. It's simply an isolated snippet of code that you can run within Org mode. Do C-c C-c when you are in this block !

Bonus for programmer : this can work with any type of language (":results output" will print the result of the console, and not the return value)

#+begin_src python :results output

print("Hello word")

#+end_src

** Tangling Code Block

The following code block has a ":tangle yes" directive. This tells Org mode to include this code in a source file when the document is tangled. Tangling is the process of extracting code blocks into a standalone script or source file, which can be executed outside of Emacs.

#+begin_src emacs-lisp :tangle yes
  ;; the code in this code block and ALL code block with ":tangle yes" will be exported
#+end_src

By tangling, you can maintain your source code within an Org document but still produce executable scripts, making your documentation and code management more integrated and fluid (like this config file).

** Noweb Reference Definition Block

This block defines a ":noweb-ref" called "test". The ":noweb-ref" is a marker that allows this block of code to be referenced by name in other parts of the document.

#+begin_src emacs-lisp :noweb-ref test
  ;; Code that can be reused in other blocks
  (defun repeat-message (message)
    (dotimes (i 3)
      (message message)))
#+end_src

You can think of ":noweb-ref" as creating a reusable code snippet that can be inserted into other code blocks using the "noweb" syntax.

** Using Noweb to Insert Code

The ":noweb yes" directive allows the inclusion of code from a ":noweb-ref block". This means that the "<<test>>" here is replaced by the content of the "test" block defined earlier.
Don't forget the ":tangle yes" if you want to export the code too (not the case here) !

#+begin_src emacs-lisp :noweb yes
    ;; Here we insert all the ":noweb-ref test" block
    <<test>>

    ;; Additional code can be added here too
    (repeat-message "Hello again!")
#+end_src

This feature is powerful for literate programming because it lets you define code in chunks that can be explained in context and reused throughout the document.

** Summary

Remember, any change to a block with ":tangle" or ":noweb-ref" has broader implications for your document's behavior and the output files. It's essential to manage these carefully, especially in a collaborative environment where the document might be sourced from a version-controlled repository.

* Configuration of Emacs and his world

** Basic things essential

*** Package Manager

#+begin_src emacs-lisp :tangle early-init.el

  ;; Disable package.el in favor of elpaca
  (setq package-enable-at-startup nil)

#+end_src

#+begin_src emacs-lisp  :tangle yes

  ;; Install elpaca
  (defvar elpaca-installer-version 0.7)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
				:ref nil :depth 1
				:files (:defaults "elpaca-test.el" (:exclude "extensions"))
				:build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
	 (build (expand-file-name "elpaca/" elpaca-builds-directory))
	 (order (cdr elpaca-order))
	 (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
	  (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
		   ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
						   ,@(when-let ((depth (plist-get order :depth)))
						       (list (format "--depth=%d" depth) "--no-single-branch"))
						   ,(plist-get order :repo) ,repo))))
		   ((zerop (call-process "git" nil buffer t "checkout"
					 (or (plist-get order :ref) "--"))))
		   (emacs (concat invocation-directory invocation-name))
		   ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
					 "--eval" "(byte-recompile-directory \".\" 0 'force)")))
		   ((require 'elpaca))
		   ((elpaca-generate-autoloads "elpaca" repo)))
	      (progn (message "%s" (buffer-string)) (kill-buffer buffer))
	    (error "%s" (with-current-buffer buffer (buffer-string))))
	((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  ;; change here, because after-init-hook don't exist ?
  (add-hook 'emacs-startup-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Uncomment for systems which cannot create symlinks:
  (when (memq system-type '(
			    ;; cygwin 
			    windows-nt
			    ;; ms-dos
			    ))
    (elpaca-no-symlink-mode))

  ;; (add-hook 'elpaca-after-init-hook (lambda () (message "🪝 elpaca-after-init-hook")))

#+end_src

*** Keep .emacs.d clean

#+begin_src emacs-lisp :tangle yes 

  (elpaca no-littering
    ;; loading of no-littering
    (require 'no-littering)
    )

#+end_src

*** Use-package

Better declaration of packages.

#+begin_src emacs-lisp :tangle yes

  ;; Install use-package
  (when (version< emacs-version "29")
    (elpaca elpaca-use-package
      ;; Enable use-package :ensure support for Elpaca.
      (elpaca-use-package-mode)

      ;; Download automatically packages missing (without :ensure t)
      (require 'use-package-ensure)
      (setq use-package-always-ensure t)
      ;; always defer package to speed up time
      (setq use-package-always-defer t)
      ))

#+end_src

*** Wait that all is ok

#+begin_src emacs-lisp :tangle yes

  ;; (elpaca-wait)

#+end_src

*** Restart until all package download

#+begin_src emacs-lisp :tangle yes

  (use-package restart-emacs)
  (add-hook 'elpaca-after-init-hook
	    (lambda ()
	      (if (eq 0 (elpaca-alist-get 'failed elpaca--status-counts 0))
		  (message "All the packages are installed, Emacs is ready !")
		(when (yes-or-no-p "Emacs has not finish to download all packages, do you want to restart ?") (restart-emacs))
		))
	    )

#+end_src

*** Configuration file
:PROPERTIES:
:ID:       fb4825b0-1c27-48da-a112-10f332205956
:END:

All the [[id:40951656-eea9-4f05-8713-eafb5bfa709e][Customize with Menu Bar]] and customized variables are stored in the "custom-file" variable. The loading of this file is here.

#+begin_src emacs-lisp :tangle yes

  (with-eval-after-load 'no-littering
    (customize-set-variable 'custom-file (no-littering-expand-etc-file-name "custom.el"))
    )

  ;; load before everything else
  (if (file-exists-p custom-file)
					  (load custom-file nil 'nomessage)
					(message "The customisation of the user [%s] is not present." custom-file))

  ;;loading of saved customizations with elpaca
  ;; (add-hook 'elpaca-after-init-hook (lambda ()
  ;; 				    (if (file-exists-p custom-file)
  ;; 					(load custom-file nil 'nomessage)
  ;; 				      (message "The customisation of the user [%s] is not present." custom-file))))

#+end_src

*** Encodings

#+begin_src emacs-lisp :tangle early-init.el

;;; Encodings
;; Contrary to what many Emacs users have in their configs, you don't need more
;; than this to make UTF-8 the default coding system:
(set-language-environment "UTF-8")
;; ...but `set-language-environment' also sets `default-input-method', which is
;; a step too opinionated.
(setq default-input-method nil)
;; ...And the clipboard on Windows could be in a wider encoding (UTF-16), so
;; leave Emacs to its own devices.
(when (memq system-type '(cygwin windows-nt ms-dos))
  (setq selection-coding-system 'utf-8))

#+end_src

*** Things just after the starting

#+begin_src emacs-lisp :tangle yes

  (setq inhibit-startup-screen t )

  (defun open-main-tutorial ()
    "Open a specific file and maximize the Emacs window on startup."
    (interactive)

    ;; trigger the loading of org-mode

    (find-file (concat user-emacs-directory "PIM/notes/tutorial/" "tutorial.org"))

    ;; all the things loading after will go here

    ;; to have access for all org variable.
    ;; (require 'org-capture)

    (if (file-exists-p custom-file)
	(load custom-file nil 'nomessage)
      (message "The customisation of the user [%s] is not present (second time)." custom-file))

    )

  (add-hook 'elpaca-after-init-hook
	    #'open-main-tutorial
	    )

#+end_src

** Things for beginners

*** If not in the minibuffer when active, close it

#+begin_src emacs-lisp :tangle yes 

(defun stop-using-minibuffer (&optional arg)
  "Kill the minibuffer when Emacs loses focus or the mouse leaves the buffer."
  (when (and (>= (recursion-depth) 1) (active-minibuffer-window))
    (abort-recursive-edit)))

;; Add to mouse-leave-buffer-hook to handle mouse leaving Emacs window
(add-hook 'mouse-leave-buffer-hook 'stop-using-minibuffer)

#+end_src


*** Better right click

#+begin_src emacs-lisp :tangle yes 

  (global-set-key [mouse-3]
		  `(menu-item ,(purecopy "Menu Bar") ignore
			      :filter ,(lambda (_)
					 (if (zerop (or (frame-parameter nil 'menu-bar-lines) 0))
					     (mouse-menu-bar-map)
					   (mouse-menu-major-mode-map)))))

#+end_src

*** Don't select part of minibuffer left of the cursor

#+begin_src emacs-lisp :tangle yes 

;; minibuffer, stop cursor going into prompt
(customize-set-variable
 'minibuffer-prompt-properties
 (quote (read-only t cursor-intangible t face minibuffer-prompt)))

#+end_src

*** Good shortcuts

**** Leave with Escape key

To replace the classic "C-g".

#+begin_src emacs-lisp :tangle yes 

  ;; make esc key do cancel. works only in gui emacs
  (define-key key-translation-map (kbd "<escape>") (kbd "C-g"))
  ;; the first don't work with all the time
  (define-key key-translation-map (kbd "ESC") (kbd "C-g"))

#+end_src


**** Normal copy and past shortcut

CUA Mode is a feature in Emacs that configures the keybindings to emulate the Common User Access (CUA) standard used in many other programs, particularly those in the Windows environment. This mode makes cut, copy, paste, and other common operations accessible through the familiar Ctrl-X, Ctrl-C, Ctrl-V, and Ctrl-Z shortcuts.

#+begin_src emacs-lisp :tangle yes 

(cua-mode 1)

#+end_src


**** Normal select all

#+begin_src emacs-lisp :tangle yes 

(global-set-key (kbd "C-a") 'mark-whole-buffer)

#+end_src

**** Normal zoom shortcut

#+begin_src emacs-lisp :tangle yes 

(global-set-key (kbd "C-c +") 'text-scale-increase)
(global-set-key (kbd "C-c -") 'text-scale-decrease)

#+end_src


*** About save

**** True auto save

#+begin_src emacs-lisp :tangle yes 

  (defcustom eepim-auto-save t
    "If t, activate the `auto-save-visited-mode', so save every `auto-save-visited-interval'."
    :type 'boolean
    :group 'eepkm)

  (when (>= emacs-major-version 26)
    ;; real auto save
    (auto-save-visited-mode eepim-auto-save)
    ;; every X seconds
    (setq auto-save-visited-interval 10))

#+end_src


**** Don't do backup file (file with ~)

#+begin_src emacs-lisp :tangle yes 

(setq make-backup-files t)

#+end_src

*** Better echo-area and minibuffer prompt

#+begin_src emacs-lisp :tangle yes 

(defun eepim-display-message (msg)
  "Display the message MSG in the echo area with yellow foreground."
  (propertize msg 'face '(:foreground "gold" :weight bold :height 1.7)))
(setq set-message-function #'eepim-display-message)

(custom-set-faces
 '(minibuffer-prompt ((t (:foreground "gold" :weight bold :height 1.7)))))

#+end_src

*** Mode and message of scratch buffer

#+begin_src emacs-lisp :tangle yes 

  (setq initial-scratch-message "This buffer is for text that is NOT saved.\n")

  (defun set-scratch-to-org-mode ()
    "Set the *scratch* buffer to use org-mode."
    (with-current-buffer "*scratch*"
      (org-mode)))

  (add-hook 'elpaca-after-init-hook 'set-scratch-to-org-mode)

#+end_src


*** Better help

#+begin_src emacs-lisp :tangle yes 

  (use-package helpful
	       :init
	       ;; Remap standard help commands to use helpful instead
	       (global-set-key [remap describe-function] 'helpful-callable)
	       (global-set-key [remap describe-variable] 'helpful-variable)
	       (global-set-key [remap describe-key] 'helpful-key)
	       (global-set-key [remap describe-command] 'helpful-command)
	       )

  ;; demo in the doc
  (use-package elisp-demos
	       :init
	       (advice-add 'describe-function-1 :after #'elisp-demos-advice-describe-function-1)
	       (with-eval-after-load 'helpful
		 (advice-add 'helpful-update :after #'elisp-demos-advice-helpful-update))
	       )

#+end_src


*** Auto revert

#+begin_src emacs-lisp :tangle yes 

  (use-package autorevert
	       :ensure nil  ; autorevert is built-in, no need to download
	       :hook (window-setup . global-auto-revert-mode)  
	       :config
	       (setq global-auto-revert-non-file-buffers t)  
	       )

#+end_src

*** Replace text when mark region

#+begin_src emacs-lisp :tangle yes 

  (delete-selection-mode 1)

#+end_src

*** Kill ring

**** Keep clipboard external

#+begin_src emacs-lisp :tangle yes 

(setq save-interprogram-paste-before-kill t)

#+end_src

** Variable of the PIM

#+begin_src emacs-lisp :tangle yes 

  (defgroup eepkm nil
    "Customization group for EasyEmacsPIM"
    :group 'main-group  ; Inherits from main-group
    :prefix "eepim-"
    )

#+end_src

** Text

*** Aesthetics

**** Wraps lines

visual-line-mode is a display mode in Emacs that wraps lines of text at the edge of the window. This mode is particularly useful for reading and editing long paragraphs of text because it allows the lines to break naturally at word boundaries without inserting hard newline characters into the text.

#+begin_src emacs-lisp :tangle yes

  ;; visuellement
  (global-visual-line-mode 1)

#+end_src

**** Fill mode

(auto-fill-mode 1)
fill-column

**** Increase size

#+begin_src emacs-lisp :tangle yes 

  (defcustom eepim-text-scale 150
    "Size of text in Emacs."
    :type 'integer
    :group 'eepkm)

  (set-face-attribute 'default (selected-frame) :height eepim-text-scale)

#+end_src


